{
  "reviews": [
    {
      "reviewer": {
        "displayName": "brownies7777"
      },
      "starRating": "FIVE",
      "comment": "Michelle Emblem is great. She is so responsive and so knowledgeable. Really appreciate working with her.",
      "createTime": "2024-06-24T19:54:05.529610Z",
      "updateTime": "2024-06-24T19:54:05.529610Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURMMEstZWx3RRAB"
    },
    {
      "reviewer": {
        "displayName": "Ciera Pratt"
      },
      "starRating": "TWO",
      "comment": "Their website says they are all about “service” but you can never get ahold of anyone.",
      "createTime": "2024-06-05T22:49:02.758996Z",
      "updateTime": "2024-06-05T22:49:02.758996Z",
      "reviewReply": {
        "comment": "Hi Ciera,\n\nWe sincerely regret that your experience did not meet your expectations. We see that the FSA team has since responded to your inquiries via voicemail and email, but if there is anything outstanding or any additional concerns, please reach out to us, and we would be happy to assist you.",
        "updateTime": "2024-06-13T14:31:05.204503Z"
      },
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUN6cDdPczB3RRAB"
    },
    {
      "reviewer": {
        "displayName": "susan villoria"
      },
      "starRating": "FIVE",
      "comment": "Ryan Delfin from Sterling Administration always gives me a 5-star service! He responds to my questions immediately. He answers all my questions knowledgeably and professionally. Always a pleasure to work with him.",
      "createTime": "2024-05-31T16:21:31.728141Z",
      "updateTime": "2024-05-31T16:21:31.728141Z",
      "reviewReply": {
        "comment": "Thank you for your fantastic feedback, Susan! We are so pleased to hear that Ryan Delfin has consistently provided you with 5-star service. Our team strives to be knowledgeable, professional, and responsive, and it's rewarding to hear that Ryan exemplifies these qualities. Your appreciation means a lot to us, and we look forward to continuing to provide you with excellent service.",
        "updateTime": "2024-06-07T05:54:51.377552Z"
      },
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUN6blA3UkdnEAE"
    },
    {
      "reviewer": {
        "displayName": "Cliff Guan"
      },
      "starRating": "FIVE",
      "comment": "Thanks John at Sterling for his outstanding service. He replied to me promptly and solved my issue in less than 24 hours. It is indeed impressive and appreciated...",
      "createTime": "2024-05-21T16:13:52.865106Z",
      "updateTime": "2024-05-21T16:13:52.865106Z",
      "reviewReply": {
        "comment": "Thank you Cliff for your kind words, and for taking the time to share your positive experience with John at Sterling Administration! We are thrilled to hear that he was able to resolve your issue promptly and efficiently. Providing outstanding service is our top priority, and it's always gratifying to receive such positive feedback. We appreciate your recognition and your support!",
        "updateTime": "2024-06-07T05:53:22.033648Z"
      },
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURUc0p6alZ3EAE"
    },
    {
      "reviewer": {
        "displayName": "The Inspower Agency"
      },
      "starRating": "ONE",
      "comment": "Anlo Hoang, supervisor to Josie Jacobo, had time to write a review about how the company treats its employees but did not find time to do their job. I sent an email to Anglo three hours BEFORE they wrote their review. I requested a response within a full week and they still have yet to respond to my email about why the company did not communicate multiple increases and admitted mistakes to the calculation of my cobra, as well as unethically taking my money from my account without my consent.\n\nWhat kind of company is this????!!!!",
      "createTime": "2024-05-20T22:57:45.783697Z",
      "updateTime": "2024-05-20T22:57:45.783697Z",
      "reviewReply": {
        "comment": "Hi Jasmine, I am sorry to hear that you did not receive your rate change letter from us and that your email was not responded to in a timely manner. We are researching what happened with the letter to ensure it does not happen again. I understand that the COBRA team was able to give you a refund for the difference in premium due to the inconvenience, and I feel confident we will provide better customer service moving forward.",
        "updateTime": "2024-06-03T06:56:07.183886Z"
      },
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNUdjR5bzJnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Toby Bigley"
      },
      "starRating": "THREE",
      "comment": "Slow or no response",
      "createTime": "2024-05-18T12:19:54.125080Z",
      "updateTime": "2024-05-18T12:19:54.125080Z",
      "reviewReply": {
        "comment": "Hi Toby,\nThank you for your feedback. I am sorry to hear your experience with the team has been less than satisfactory. I do not see any communications sent in from you since January 2023, so I want to be sure you have our correct contact information. If you have any questions or concerns regarding your plan, please reach out to us at benefits@sterlingadministration.com or call us at 800.617.4729 and we would be happy to assist.\n",
        "updateTime": "2024-06-03T06:55:10.618396Z"
      },
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNUdzlpZk53EAE"
    },
    {
      "reviewer": {
        "displayName": "Jiaan Wu"
      },
      "starRating": "FIVE",
      "comment": "Best TPA in the market! I have been working with the sales team, renewal team, and day-to-day service team. John Cruz, Jessica Hogan, and Kristine Farrell are all professional and efficient!",
      "createTime": "2024-05-15T19:44:10.585900Z",
      "updateTime": "2024-05-15T19:44:10.585900Z",
      "reviewReply": {
        "comment": "Thank you for your glowing review! We are delighted to hear that you have had such a positive experience with our sales team, renewal team, and day-to-day service team. John Cruz, Jessica Hogan, and Kristine Farrell will be thrilled to hear your praises. We are committed to professionalism and efficiency, and it's wonderful to know that our efforts are making a difference for you. We appreciate your continued trust in the Sterling Administration!",
        "updateTime": "2024-06-07T05:54:25.000899Z"
      },
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNUa1lDWUdnEAE"
    },
    {
      "reviewer": {
        "displayName": "Carol Houseman"
      },
      "starRating": "ONE",
      "comment": "Today they owe me almost $2000. That is 4 months of $490. Dozens of phone calls, seldom answered or returned. All documentation sent sometimes several times. Their \"check writing function is not working\"  My husband is 92. Their representative said today she has thousands of emails. If thousands of dollars are being withheld from thousands over 90 consider the interest and the odds that much of it will be overlooked or forgotten. Sounds like a business strategy to us.",
      "createTime": "2024-05-14T19:00:27.546968Z",
      "updateTime": "2024-05-14T19:00:27.546968Z",
      "reviewReply": {
        "comment": "Hi Carol,\n\nI am so sorry to hear your experience with Sterling has been so frustrating. Unfortunately we did lose our ability to write checks for several months due to an issue at our mailing vendor, but we could always ACH the money to you and ACH payments are delivered within several days. I see that the ACH payment was presented to your husband but he declined that option and decided to wait for the checks to be available, which were sent out in early May. I know it was a very stressful time for all and I hope moving forward we can prove to you through our service that requests for disbursement are completed in a timely manner. Please reach out to us at 800.617.4729 if you have any further questions or concerns.\n",
        "updateTime": "2024-06-03T06:54:32.312823Z"
      },
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNUanVtcnZRRRAB"
    },
    {
      "reviewer": {
        "displayName": "Sandi Carpenter"
      },
      "starRating": "FIVE",
      "comment": "Incredible customer service; always responds and handles issues quickly, professional, and always a pleasure to work with.",
      "createTime": "2024-05-10T22:21:11.001822Z",
      "updateTime": "2024-05-10T22:21:11.001822Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNULU5DcGJ3EAE"
    },
    {
      "reviewer": {
        "displayName": "Yvonne Eisenman"
      },
      "starRating": "FIVE",
      "comment": "Sterling Administration is a wonderful company to work for. Sterling has a great family culture and values its employees and the hard work each employee produces.  This principle is extended to how the company values its clients as well. Sterling is committed and strives to provide the best Sterling service.",
      "createTime": "2024-04-25T20:41:00.733592Z",
      "updateTime": "2024-05-10T22:12:17.539828Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNqeTdXTkF3EAE"
    },
    {
      "reviewer": {
        "displayName": "Anlo Hoang"
      },
      "starRating": "FIVE",
      "comment": "Sterling is a great place to work at. They establish a clear value for the organization and there is always room for growth. They listen to their employees's feedback and are open-minded. Sterling is a great company with work-life balance.",
      "createTime": "2024-04-25T17:58:59.717333Z",
      "updateTime": "2024-05-10T21:34:44.165547Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNqaTVyaTRBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Sheila Black"
      },
      "starRating": "FIVE",
      "comment": "Ryan who is our representative is so calm and respectful. I am new to this and he was so kind to walk me through the entire process of creating a new cobra entry. I am very nervous when putting things into the computer or updating things. I had a glitch and Ryan was so patient and calm and again walked me through the process of fixing it. Thank goodness for people like Ryan! He reassured me by telling me if I had any questions or if I needed anything else to please call him. He deserves a raise!!",
      "createTime": "2024-05-10T20:31:52.389766Z",
      "updateTime": "2024-05-10T20:31:52.389766Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNUdU9MWkRnEAE"
    },
    {
      "reviewer": {
        "displayName": "Cheryl Cote"
      },
      "starRating": "FIVE",
      "comment": "Jon Cruz is a Senior Cobra Specialist and I have been working with him on one of our larger COBRA groups. He is fantastic, knowledgeable and responsive. I seem to turn to him for all my Sterling questions and if he isn't the person, he points me to the correct person. I am impressed and appreciate all he does. Thank you.",
      "createTime": "2024-05-09T22:32:29.499152Z",
      "updateTime": "2024-05-09T22:32:29.499152Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNUa0tyVTZnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Duke Martin"
      },
      "starRating": "FIVE",
      "comment": "If one has too much on their plate, efficiency will always suffer in everything else. The business may look awful to most people from the outside , but in over ten years, I haven't seen a more committed and passionate group of people at work. Maybe we could have made more people happy if one person could only do as much as three could.",
      "createTime": "2024-05-07T20:58:05.437146Z",
      "updateTime": "2024-05-07T20:58:05.437146Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURqMjdEeXd3RRAB"
    },
    {
      "reviewer": {
        "displayName": "Natalie Rokovich"
      },
      "starRating": "FIVE",
      "comment": "We have used Sterling Administration many times in the past! Michelle Emblem is always there for whatever questions I have and to help guide me. We appreciate them helping this difficult process be as seamless as possible!",
      "createTime": "2024-05-06T14:56:21.706133Z",
      "updateTime": "2024-05-06T14:56:21.706133Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURqM2FtTGdBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Susana Portillo"
      },
      "starRating": "FOUR",
      "comment": "Overall, I had a good experience with Sterling. Our compliance manager was attentive and knowledgeable. Her response time was great and was able to guide us through the process.",
      "createTime": "2024-05-03T15:11:07.146459Z",
      "updateTime": "2024-05-03T15:11:07.146459Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURqbnZlbUx3EAE"
    },
    {
      "reviewer": {
        "displayName": "Tracie Carter"
      },
      "starRating": "FIVE",
      "comment": "Service driven while striving for excellence - that is how Sterling approaches both external and internal clients. As an  internal customer, Sterling has proven to be a family-oriented Company that I\u0027m proud to be a part of! If you are looking for work/life balance while helping others, this is the place to be. From the Executive Leaders to peer groups, everyone is easily accessible and cares about your well-being. The work is rewarding and internal promotions are celebrated. Great Company with Great people!",
      "createTime": "2024-04-25T18:55:34.019271Z",
      "updateTime": "2024-04-25T18:55:34.019271Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNqaS12cEJ3EAE"
    },
    {
      "reviewer": {
        "displayName": "Marcie DeLaCruz"
      },
      "starRating": "FIVE",
      "comment": "At Sterling Administration, I thoroughly enjoy the people that I work with and the camaraderie as we come together to create enjoyable experiences for each other and our clients.",
      "createTime": "2024-04-25T18:20:00.898613Z",
      "updateTime": "2024-04-25T18:20:00.898613Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNqaTVHeWF3EAE"
    },
    {
      "reviewer": {
        "displayName": "Suzie Roehrenbach"
      },
      "starRating": "FIVE",
      "comment": "I love having my FSA and HSA accounts with Sterling Administration. It's a one-stop shop for all of my financial benefit needs. Their app is very handy to use when you're on the go. I can easily access my balances and other pertinent details of my accounts.",
      "createTime": "2024-04-25T18:19:32.446726Z",
      "updateTime": "2024-04-25T18:19:32.446726Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNqaS1ITlJnEAE"
    },
    {
      "reviewer": {
        "displayName": "Josie Jaay"
      },
      "starRating": "FIVE",
      "comment": "Very helpful customer service. They were able to answer my questions and provide solutions.",
      "createTime": "2024-04-25T18:03:14.348193Z",
      "updateTime": "2024-04-25T18:03:14.348193Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNqaThiaTVRRRAB"
    },
    
    {
      "reviewer": {
        "displayName": "Lindsey Neville"
      },
      "starRating": "FIVE",
      "comment": "As an HSA account holder, I find the app super easy to use to submit claims for reimbursement. The money is deposited in my account quickly and easily. As an EE of the company, I appreciate how our voices are heard when discussing ways to constantly improve our services for our clients and participants.",
      "createTime": "2024-04-25T18:02:28.955469Z",
      "updateTime": "2024-04-25T18:02:28.955469Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNqaTRhLTBnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Mike Puente"
      },
      "starRating": "FIVE",
      "comment": "Sterling is a wonderful company to work for. They care about their employees and families and offer a good work-life balance. As a Sales Director, in order to be successful, I must believe in our organization, and I absolutely do! I am confident in our people and the services we offer. Wouldn't want to work anywhere else.",
      "createTime": "2024-04-25T13:42:46.164108Z",
      "updateTime": "2024-04-25T13:42:46.164108Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNqMF92aDFBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Dorothea Baker"
      },
      "starRating": "ONE",
      "comment": "Absolutely terrible customer service. Absolute trash of a company! I\u0027ve been trying to retrieve funds owed to me for over 4 months. I have been going in circles speaking to staff that are short and incompetent. Super frustrating. Even the supervisors are dumb.",
      "createTime": "2024-04-17T20:10:31.301736Z",
      "updateTime": "2024-04-17T20:10:31.301736Z",
      "reviewReply": {
        "comment": "I am deeply sorry to hear your experience with Sterling has been so terrible. I know that the ID verification process can be tedious, but unfortunately it is a requirement that it be completed to keep our participants and the company safe. We are looking into ways we can make it a more streamlined process with less back and forth for our participants. We appreciate your patience with us and look forward to providing you excellent customer service moving forward.\n",
        "updateTime": "2024-06-03T06:59:00.345505Z"
      },
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNqdUpuS0lBEAE"
    },
    {
      "reviewer": {
        "displayName": "Rick Monteiro"
      },
      "starRating": "ONE",
      "comment": "Terrible HSA administration company. In December of 2023 they failed to disperse requested funds for 18 days.\nStaff and administration are incompetent. I\u0027m on 21 days and count to fund my 2024 maximum contribution base on inaccurate and incomplete instructions. 21 emails later they received the funds on Thursday and on Friday they told me they were hoping to show the deposit on Monday or Tuesday.\nIf you have a choice on another HSA administration company run from Sterling. They are getting rich on fees and inappropriately hold your funds at your expense.",
      "createTime": "2024-04-14T16:24:56.405774Z",
      "updateTime": "2024-04-14T16:24:56.405774Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUREMi03SzNBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Luisa Pineros"
      },
      "starRating": "ONE",
      "createTime": "2024-04-09T19:39:47.532999Z",
      "updateTime": "2024-04-09T19:39:47.532999Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUREN3JlaktREAE"
    },
    {
      "reviewer": {
        "displayName": "Chelsea Passmore"
      },
      "starRating": "ONE",
      "comment": "Disgusting customer service. Horrible website makes everything a million times harder. And almost completely uncommunicative. Not to mention they make mistakes and then expect you to feel bad for getting upset about their money costing mistakes. Did not create my card and now I’m suffering trying to get refunded for their mistake.",
      "createTime": "2024-04-02T22:36:38.700958Z",
      "updateTime": "2024-04-02T22:36:38.700958Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNEbDlQOGhBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Katsura Edamaru"
      },
      "starRating": "ONE",
      "comment": "It\u0027s pretty bad, I was not aware of the monthly charge they put on my account for years. Usually there will be a notification after you left the company or your company is acquired by another company. But as I remember, I can\u0027t think of I have received it from this company. Also, the 8+ dollars monthly fee is high since you are not really manage my money.",
      "createTime": "2024-03-05T22:30:42.709427Z",
      "updateTime": "2024-03-05T22:30:42.709427Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUM5N3R1eXVBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Yanira Rivera"
      },
      "starRating": "ONE",
      "comment": "BEWARE!!! I am a simple person, i hate confrontation, and i pay my bills on time. This company has caused me so much stress. I had no choice in picking this company when i decided to leave my former employers and continue my heath coverage with Cobra but if someone does have a choice DO NOT PICK THIS COMPANY!!! Awful customer service!!",
      "createTime": "2024-02-20T21:43:09.458196Z",
      "updateTime": "2024-02-20T21:43:09.458196Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURkdVB6WE1BEAE"
    },
    {
      "reviewer": {
        "displayName": "Yanira Rivera"
      },
      "starRating": "ONE",
      "comment": "0 STARS!!!!  It makes me so sad that this a women owned company because it is complete trash!! I have been given the run around for months and all I wanted to do was pay my bill! I requested invoices to be sent to me so I can pay and no one would answer my calls or call back. I called 1 day over 100 times. Screw this awful company!",
      "createTime": "2024-02-16T23:24:25.936662Z",
      "updateTime": "2024-02-16T23:24:25.936662Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNkbFotekRnEAE"
    },
    {
      "reviewer": {
        "displayName": "Rebekah Aronson"
      },
      "starRating": "ONE",
      "createTime": "2024-02-16T15:08:18.259963Z",
      "updateTime": "2024-02-16T15:08:18.259963Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNkdWJmdnJnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Anthony M"
      },
      "starRating": "ONE",
      "comment": "These people are tough to work with.  Long hold times whenever you call.  Sometimes you call and get hung up on.  Other times you call and they play a message that it is outside business hours, when it actually isn\u0027t.  If feels like there\u0027s maybe 1 person working here on a very casual part-time basis.  Would not recommend, would not choose to use their services in the future and closing account with them.",
      "createTime": "2024-02-09T00:40:03.465962Z",
      "updateTime": "2024-02-09T00:40:03.465962Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUR0bi12Zlp3EAE"
    },
    {
      "reviewer": {
        "displayName": "Danny Duran"
      },
      "starRating": "ONE",
      "comment": "This company is a scam. They will not allow you to speak to supervisors and they are not interested in offering any service. I will be contacting the Better Business Bureau and suggest everyone else do the same.",
      "createTime": "2024-02-06T23:18:34.496651Z",
      "updateTime": "2024-02-06T23:18:34.496651Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUR0ODlicnRRRRAB"
    },
    {
      "reviewer": {
        "displayName": "Krista Borgquist"
      },
      "starRating": "ONE",
      "comment": "If I could give Sterling Administration 0 stars I would. When I left my previous employer I knew I had 90 days to submit my remaining receipts for reimbursement. I was immediately locked out of my account and spent months trying to regain access with little to no help from the \"customer service\" team. Ultimately, they were unable to help me regain access and as the end of the 90 days was approaching asked me to hand write submission forms. I did this, I submitted the receipts, and I asked if the documentation was sufficient and anything else needed. I asked multiple times over the course of two weeks. The response finally came that my documentation was sufficient and a check was being sent. Now, after the 90 days have passed - a time frame they were well aware of, they are coming back and saying the documentation is no longer sufficient and I can go through a long process to appeal their decision. The information provided on how I would know what was required and why the claim was denied was on the account they would not help me gain access to.",
      "createTime": "2024-01-29T17:58:49.173175Z",
      "updateTime": "2024-01-29T17:58:49.173175Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUN0M05YT2RBEAE"
    },
    {
      "reviewer": {
        "displayName": "Jason Glavis"
      },
      "starRating": "ONE",
      "comment": "trash , horrible , Not only do they not return phone calls ,\nthey routinely deny claims for no reason I can only assume inept laziness , Expect to be on hold for 30 minutes to an hour just to be sent to a voicemail\nI\u0027m sure the executives are raking in the dough At this so-called company again just trash",
      "createTime": "2024-01-13T14:41:55.962398Z",
      "updateTime": "2024-01-13T14:41:55.962398Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNOeXFDZHJRRRAB"
    },
    {
      "reviewer": {
        "displayName": "Isdrevi (Isdrevi)"
      },
      "starRating": "ONE",
      "comment": "If 0 star is an option that’s what I would choose! I’m having a hard time trying to to get a reimbursement back from Sterling, I went to the urgent care on 12/22/23 and after the service I went to swipe my Sterling card and it declined and tried several times and declined every time, there was a line and I had to pay via my debit card. I submitted countless Claims and they all getting denied due to “insufficient Documentation”, I call them and waited to talk to someone and told me about 1hr 45mins and I told them my situation and they said it was insufficient documentation, and I submitted new claims with new documents and keep getting declined and have to call them again to see what’s going on! Every time I call them they give me a different excuse to why it’s getting declined, Like: The documentation is not clear and not visible! How?… it’s a PDF documentation. I call them again and they said ohh the documentation doesn’t have your name in it, I submitted a new claim another excuse, we can’t see which debit card you paid with, submitted my receipt from previous claims , and another excuse it doesn’t show the amount you paid. So every time I call they give me an excuse after excuse and they tell me what they need and I put it on the claims and still getting declined. ALL THEY DO IS GIVE EXUCSE! Why pay when guys cant even resolve a $50 claim. Our Company pays for your services and you guys don’t even do nothing. Worst Service \u0026 Company Overall! Don’t even bother to contract this company.",
      "createTime": "2024-01-09T20:10:06.304722Z",
      "updateTime": "2024-01-09T20:10:06.304722Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUQxbzZiZ1RREAE"
    },
    {
      "reviewer": {
        "displayName": "Loretta S"
      },
      "starRating": "ONE",
      "comment": "Sterling Health Services never ever ever answers phone calls. If you are able to talk to a live person it\u0027s a miracle!",
      "createTime": "2023-08-31T15:18:27.126135Z",
      "updateTime": "2023-08-31T15:18:27.126135Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURwejlLYjNnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Jenna Patrick"
      },
      "starRating": "ONE",
      "comment": "AVOID this company! You inquire about services and before you know it, you are on the hook for a service they have not rendered.. OH and you can\u0027t even talk to someone about it because they don\u0027t answer the phone! YET they are reporting us to collections..  laughable. I looked up the AR person on LinkedIn and his profile has an #openforwork banner.. something fishy is going on.",
      "createTime": "2023-08-21T17:52:02.129364Z",
      "updateTime": "2023-08-21T17:52:02.129364Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURwdHBYTFFBEAE"
    },
    {
      "reviewer": {
        "displayName": "Renee Huerta"
      },
      "starRating": "FIVE",
      "createTime": "2023-08-16T01:32:52.080532Z",
      "updateTime": "2023-08-16T01:32:52.080532Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURwLUtuLTNBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Karen Natsuhara"
      },
      "starRating": "ONE",
      "comment": "Terrible company. Do not use them. Poor / non existent customer service. Will not release my funds as requested over two weeks ago!",
      "createTime": "2023-08-01T13:52:04.643666Z",
      "updateTime": "2023-08-01T13:52:04.643666Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNweXVYazJ3RRAB"
    },
    {
      "reviewer": {
        "displayName": "Kevin Bass"
      },
      "starRating": "ONE",
      "createTime": "2023-07-22T18:02:06.986974Z",
      "updateTime": "2023-07-22T18:04:21.366054Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURKaS1QUHFBRRAB"
    },
    
    {
      "reviewer": {
        "displayName": "GPT VN 1"
      },
      "starRating": "ONE",
      "comment": "The customer phone number is a voicemail.  No one ever pick up.  Left messages no one return my calls.  Just try to solve the log in issue but the website keeps having issue with register, enrollment page.  So frustrating....",
      "createTime": "2023-07-18T23:23:54.793493Z",
      "updateTime": "2023-07-18T23:24:51.221178Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURKMGMtTlB3EAE"
    },
    {
      "reviewer": {
        "displayName": "Stewart Douglas"
      },
      "starRating": "ONE",
      "comment": "AVOID THIS COMPANY AT ALL COSTS.\nAwful, awful, awful  company. I actually cancelled or early term ended my Healthcare, now I don\u0027t have any, They wouldn\u0027t take my money, Month after Month I would set up a recurring payment, they would wait two months then send a threatening letter saying that my Healthcare had been suspended. I got tired of it. This time they did the same thing only told me that it could not be reactivated I quote \"Hello xxxxxx, we regret for the inconvenience, but we are bound by the laws and regulations that govern the administration of your former employer\u0027s group benefit plan.\"\n\nThey wouldn\u0027t take the money. I couldn\u0027t log in to the site as it said user name and password were incorrect but no one would get back to me until I wrote a real threatening email and surprise it worked again without any changes.\n\nEven when I signed up it was 3 months before my Cobra through Bluesheild was activated, in the end I had to call Bluesheild and they got it going. No-one would respond to my calls or my emails.\n\nThey won\u0027t return calls in any kind of timely manner, if they do respond they\u0027ll leave a voice mail so you have no written record, email responses take a week or so, sometimes two. I suspect they were hired as the Administrator of Cobra so I would quit using it and my former employer could walk away from their liabilities, there\u0027s some sort of scam going on.\n\nRead their Yelp and Google and BBB reviews, they have one star on almost every single one,  they\u0027ve failed to make payments for people that are suffering from Cancer and other diseases. They have a flood of employee reviews, all around 3 stars and I suspect someone clever published those to drown out or deflect from the massive amount of poor customer 1 star reviews.",
      "createTime": "2023-07-12T17:45:38.765620Z",
      "updateTime": "2023-07-12T17:45:38.765620Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURKblAzVmN3EAE"
    },
    {
      "reviewer": {
        "displayName": "Lowkey"
      },
      "starRating": "TWO",
      "comment": "Hard to contact a real person.",
      "createTime": "2023-06-05T16:15:36.194456Z",
      "updateTime": "2023-06-05T16:15:36.194456Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUR4OHR1MHZnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Nathanael Steele"
      },
      "starRating": "ONE",
      "comment": "Unanswered phone calls, incorrect account balances, and murky communication.",
      "createTime": "2023-05-31T22:39:58.235100Z",
      "updateTime": "2023-05-31T22:39:58.235100Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUR4Nk8zVldnEAE"
    },
    {
      "reviewer": {
        "displayName": "Frederick Howden"
      },
      "starRating": "FIVE",
      "createTime": "2023-05-20T16:22:40.744445Z",
      "updateTime": "2023-05-20T16:22:40.744445Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUN4cVlpbThnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Neal"
      },
      "starRating": "ONE",
      "comment": "Everytime I have to deal with Sterling HSA is torture. The support people know nearly nothing and the website was created by a kid in junior high school. How pathetic! I have \"suggested\" that my college find a new HSA but they are, unfortunately, as brain-dead as Sterling.",
      "createTime": "2023-03-22T18:27:22.240458Z",
      "updateTime": "2023-03-22T18:32:34.743227Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNSNElPN1hBEAE"
    },
    {
      "reviewer": {
        "displayName": "Carlos Escobar"
      },
      "starRating": "ONE",
      "comment": "(Translated by Google) They never answer calls\n\n(Original)\nNunca responden las llamadas",
      "createTime": "2023-03-20T23:51:05.469569Z",
      "updateTime": "2023-03-20T23:51:05.469569Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURocl9yWHB3RRAB"
    },
    {
      "reviewer": {
        "displayName": "Shane Ẽire Byrne"
      },
      "starRating": "FIVE",
      "createTime": "2023-03-18T00:32:56.043671Z",
      "updateTime": "2023-03-18T00:32:56.043671Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURocTZ5TkxnEAE"
    },
    {
      "reviewer": {
        "displayName": "kristen Olson"
      },
      "starRating": "ONE",
      "comment": "They don’t answer their phones no one is “available” they are suppose to be a customer service organization - I think not! I would give them a zero if available",
      "createTime": "2022-12-22T19:01:56.434834Z",
      "updateTime": "2022-12-22T19:01:56.434834Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNCbXNtTDJRRRAB"
    },
    {
      "reviewer": {
        "displayName": "Christina Gutierrez"
      },
      "starRating": "ONE",
      "createTime": "2022-12-10T04:30:54.170086Z",
      "updateTime": "2022-12-10T04:30:54.170086Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUQtNjV2czNnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Mohamed Nasrullah"
      },
      "starRating": "ONE",
      "comment": "One star of protest as I could not give negative five.\n\nSimply the worst HSA service provider I had to deal with.\n\nEvery claim by dependents is marked for review even though the list of dependents was provided at the time of enrollment.\n\nI lost close to $500 at end of the year as result of delays caused due to providing the documentation and re-activating the card.\n\nBecause of this, I did not enroll for HSA with my employer and strongly recommended the HR to discontinue using Sterling\u0027s services.",
      "createTime": "2022-11-16T23:01:46.076781Z",
      "updateTime": "2022-11-16T23:01:46.076781Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUMtcjhIdVRnEAE"
    },
    {
      "reviewer": {
        "displayName": "Glen Eberts"
      },
      "starRating": "ONE",
      "comment": "The worst HSA I’ve ever had. HSA debit card doesn’t work, website is terrible, no one picks up the phone after trying for several days, and they have HSA fees for their terrible service. I am constantly moving my HSA money over to HealthEquity, and hope my company terminates their service asap. HealthEquity is better on every conceivable aspect of service, and doesn’t have HSA fees! Sterling HSA is straight trash!",
      "createTime": "2022-11-04T18:43:04.229125Z",
      "updateTime": "2022-11-04T18:43:04.229125Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUMtbm9xN3dBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Kate Slater"
      },
      "starRating": "ONE",
      "comment": "Echoing what everyone else has said - phone calls and emails go unanswered. For weeks. What in the actual hell is wrong with this company? Why even have a customer service line?",
      "createTime": "2022-08-08T15:20:04.119822Z",
      "updateTime": "2022-08-08T15:20:04.119822Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUN1MTYyOHpBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Deborah Schleuter"
      },
      "starRating": "ONE",
      "comment": "The worst service I\u0027ve ever experienced with any medical insurance facilitator. I\u0027ve had my COBRA with them since May 2021. Everytime I need to use it the Dr. Office has trouble getting benefits verified and I have to call Sterling to fix it. Since I\u0027ve done this 5 times now I\u0027d say they never really fixed it the first, second or even third time.",
      "createTime": "2022-07-19T18:55:02.703809Z",
      "updateTime": "2022-07-19T18:55:02.703809Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUN1eUxTRlJBEAE"
    },
    {
      "reviewer": {
        "displayName": "Krissy Graham"
      },
      "starRating": "FOUR",
      "createTime": "2022-06-06T04:00:26.957080Z",
      "updateTime": "2022-06-06T04:00:26.957080Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNPMHU2Qm9RRRAB"
    },
    {
      "reviewer": {
        "displayName": "Lady Alane Quien - Eliana Batyah"
      },
      "starRating": "FIVE",
      "comment": "Awesome",
      "createTime": "2022-04-22T11:46:51.362036Z",
      "updateTime": "2022-04-22T11:46:51.362036Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUMyZ1pTLXZBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Greg Schwinghammer"
      },
      "starRating": "FIVE",
      "createTime": "2022-03-23T13:29:23.723033Z",
      "updateTime": "2022-03-23T13:29:23.723033Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURXMXVuNXdRRRAB"
    },
    {
      "reviewer": {
        "displayName": "Liz “Lizzzz” Zzzz"
      },
      "starRating": "TWO",
      "comment": "So my former employer in AUSTIN uses them as their COBRA administrator for some reason. Their customer service is awful. 2 times my insurance got cancelled even though I had paid. Not sure if this was the employer or Sterling but in both cases it took days for my insurance to be reinstated. I have severe medical issues and can\u0027t just go without medical care nor can I afford to pay out of pocket for prescriptions and such seeing as how I am ya know unemployed.",
      "createTime": "2022-02-28T00:55:12.485845Z",
      "updateTime": "2022-02-28T00:56:31.314241Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNXbnBPSjd3RRAB"
    },
    {
      "reviewer": {
        "displayName": "Humera Bibi"
      },
      "starRating": "FIVE",
      "createTime": "2022-01-11T04:00:21.152651Z",
      "updateTime": "2022-01-11T04:00:21.152651Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNtLTdQcmVREAE"
    },
    {
      "reviewer": {
        "displayName": "Pete Johnson"
      },
      "starRating": "ONE",
      "comment": "They are the Cobra administrators for my policy. They have 2 out out of the last 3 months failed to forward my payments on time and my insurance has been interupted causing my medical procedures to be post poned . I am a cancer patient and it is difficult to get them rescheduled . When you call them all you get is the run around and explanation of how nothing is eber their fault. That is not what you are told when you talk to the insurance company. I wish you all the luck in the world if you have the misfortune to have to deal with these people.",
      "createTime": "2021-12-06T20:33:51.358538Z",
      "updateTime": "2021-12-06T20:33:51.358538Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURHM2VEOG13RRAB"
    },
    
    {
      "reviewer": {
        "displayName": "Sophie Doodle"
      },
      "starRating": "ONE",
      "comment": "Absolutely zero service, they don’t return phone calls and dispense incorrect information to employees and to the employer. They collect payments from employees to pay for coverage that the insurance carriers won’t accept. Dreadful company to work with and their fees are very high; especially when you get no service or response.",
      "createTime": "2021-10-05T20:57:35.009324Z",
      "updateTime": "2021-10-05T20:57:35.009324Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUQ2cFkzNVlnEAE"
    },
    {
      "reviewer": {
        "displayName": "Robert york"
      },
      "starRating": "TWO",
      "createTime": "2021-06-29T19:22:01.852355Z",
      "updateTime": "2021-06-29T19:22:01.852355Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURxbE9uWHd3RRAB"
    },
    {
      "reviewer": {
        "displayName": "Bradley Gent"
      },
      "starRating": "ONE",
      "createTime": "2021-06-03T03:44:28.428708Z",
      "updateTime": "2021-06-03T03:44:28.428708Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNxNnFDSjNnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Dom Greber"
      },
      "starRating": "ONE",
      "comment": "I’ve been on hold multiple times, always prompted  to leave a voicemail after 8 minutes and nobody ever calls back. Sent multiple emails and never got a response. I think this company just takes in money but never actually pays it back out to you. They keep charging your account a ridiculous fee even if you don’t use so beware, you’ll lose all your money very fast!",
      "createTime": "2021-05-06T17:05:14.260513Z",
      "updateTime": "2021-05-06T17:05:14.260513Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURLOHNiUm9BRRAB"
    },
    {
      "reviewer": {
        "displayName": "Juan Tachiquin"
      },
      "starRating": "FIVE",
      "createTime": "2021-04-02T20:22:19.011524Z",
      "updateTime": "2021-04-02T20:22:19.011524Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNLLW9TZmZ3EAE"
    },
    {
      "reviewer": {
        "displayName": "Erin Sanfilippo"
      },
      "starRating": "THREE",
      "createTime": "2021-02-23T03:51:17.782401Z",
      "updateTime": "2021-02-23T03:51:17.782401Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUR5bVB6LXh3RRAB"
    },
    {
      "reviewer": {
        "displayName": "Lee Perry"
      },
      "starRating": "FIVE",
      "comment": "Sterling Administration, they handle people's red tape as it pertains to their health savings accounts. They are amazing. Very kind and considerate. Extremely knowledgeable wherever a member may encounter issues or difficulties navigating their way through the system, which can be a challenge at first. Once Sterling Staff helps you through it a time or ten, it will be old hats. Thank you Sterling Administration. Lee.",
      "createTime": "2021-02-09T07:18:14.646430Z",
      "updateTime": "2021-02-09T07:22:35.555804Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUN5cmY3UGNBEAE"
    },
    {
      "reviewer": {
        "displayName": "Xuliang Yan"
      },
      "starRating": "ONE",
      "comment": "They keep charging you a monthly fee even after you stop save money in the account and they did nothing for me. The ad says they will refund you up to one year monthly fee if you’re not satisfied with their service. Sure I’m not happy. But it’s a scam. It only shows up in Google search result. The official website hides this false statement. Called for hours. Service people was not helpful at all, denying they have this refund policy, showed contempt to my right in all sort of ways in a passive aggressive manner. I later tried to transfer my HSA out of Sterling to Fidelity for the latter charges no monthly fee. But it takes forever to get the transaction completed. I don’t even find a way to complain. It’s still in pending.",
      "createTime": "2021-02-02T05:28:24.582690Z",
      "updateTime": "2021-02-02T05:28:24.582690Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUN5d2FlZTdBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Florence Garcia"
      },
      "starRating": "FIVE",
      "comment": "Always easy to manage this website",
      "createTime": "2021-01-19T23:01:09.881326Z",
      "updateTime": "2021-01-19T23:01:23.922294Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUN5eEttekpBEAE"
    },
    {
      "reviewer": {
        "displayName": "Karen Prasad"
      },
      "starRating": "FIVE",
      "comment": "Have my HSA through them and they are excellent",
      "createTime": "2020-11-30T03:07:43.226489Z",
      "updateTime": "2020-11-30T03:07:43.226489Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURpd3QtMGlRRRAB"
    },
    {
      "reviewer": {
        "displayName": "Nick Muresan"
      },
      "starRating": "FIVE",
      "comment": "Perfect health care option",
      "createTime": "2020-09-30T19:33:23.330738Z",
      "updateTime": "2020-09-30T19:33:23.806806Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSURDa2ZlamdBRRAB"
    },
    {
      "reviewer": {
        "displayName": "Yossi A"
      },
      "starRating": "ONE",
      "comment": "By far one of the WORST company to deal with. Unprofessional, untrained staff and incompetent beyond words.",
      "createTime": "2020-08-18T06:34:43.164041Z",
      "updateTime": "2020-08-18T06:34:43.164041Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNDMHJqVEJREAE"
    },
    {
      "reviewer": {
        "displayName": "Juanita Lujan"
      },
      "starRating": "FIVE",
      "comment": "Easy to navigate",
      "createTime": "2020-06-27T04:44:11.964092Z",
      "updateTime": "2020-06-27T04:44:11.964092Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUM4dk42S1VBEAE"
    },
    {
      "reviewer": {
        "displayName": "ashika Garcia"
      },
      "starRating": "ONE",
      "createTime": "2019-12-19T22:17:47.901171Z",
      "updateTime": "2019-12-19T22:17:49.165568Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURNck1hUUNBEAE"
    },
    {
      "reviewer": {
        "displayName": "Sean Cody"
      },
      "starRating": "ONE",
      "comment": "Logging in to check your account is like trying to steal the declaration of independence. Emails go unanswered. No certainty as to whether funds will be available. This is the only bank I have ever had these issues with.",
      "createTime": "2019-12-11T18:44:14.468251Z",
      "updateTime": "2019-12-11T18:44:14.468251Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNNdjRtSFhREAE"
    },
    {
      "reviewer": {
        "displayName": "Jorge Lopez"
      },
      "starRating": "FIVE",
      "comment": "Great Company, with Awesome Customer Services!",
      "createTime": "2019-11-01T23:50:30.881932Z",
      "updateTime": "2019-11-01T23:50:30.881932Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUQwMnFlOHhnRRAB"
    },
    {
      "reviewer": {
        "displayName": "Sequoia Grimble"
      },
      "starRating": "THREE",
      "createTime": "2019-09-10T00:08:36.555890Z",
      "updateTime": "2019-09-10T00:08:36.555890Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURVXzd6Q1p3EAE"
    },
    {
      "reviewer": {
        "displayName": "Eva Barham"
      },
      "starRating": "ONE",
      "comment": "Several years ago, I started an individual HSA at Sterling. It was cumbersome, and took a ridiculous amount of time and effort to set up and GIVE them Money. Transferring money which you must first deposit with Sterling to invest with their partner, TDA, takes a ridiculous amount of time. Their website is very poorly designed.... your account links are on the left margin, blank space to the right....click a link, and you don\u0027t see that your info has loaded far down on the page. EVERY year-end (December), there is an issue with incorrect information on the site about next year\u0027s contribution limits and the application appears to allow scheduling a contribution in December for a January contribution, but in fact fails. Every year I ask to have this escalated to the Tech Dept, and every year the problem persists. After yet another change to terms (they now require I keep an extra $500 idle in the base account and cannot transfer / invest it at TDA, so they earn money on my money, while I lose out), I am trying to transfer to a new HSA administrator and shut this mess down. NO progress in over two weeks and multiple calls, letters, emails from me, TDA,or Fidelity (new HSA administrator); I now discovered multiple Service reps gave me explicitly wrong info. Promises for a call back result in no call. They don\u0027t tell you upfront, but they have no process or will not do an institution-to-institution transfer if you want to move your HSA to another administrator. Apparently, they\u0027ll take your money but make it very difficult to get it back. I would NEVER recommend Sterling!",
      "createTime": "2019-02-21T03:24:31.250439Z",
      "updateTime": "2019-02-21T03:24:31.250439Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChdDSUhNMG9nS0VJQ0FnSUNvLWFDT3hRRRAB"
    },
    {
      "reviewer": {
        "displayName": "Natalie Davis"
      },
      "starRating": "ONE",
      "comment": "Took 3 weeks to get an email response to a support question I had. I emailed them 3 TIMES over the course of a 2 week period and after I received a response asking for my info, it took another WEEK to have them take action. Very frustrating.",
      "createTime": "2018-02-21T17:26:32.617Z",
      "updateTime": "2018-02-21T17:26:32.617Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNRMzRUOU13EAE"
    },
    {
      "reviewer": {
        "displayName": "Gregory Pelletteri"
      },
      "starRating": "ONE",
      "comment": "THE WORST! JUST THE WORST IF YOU NEED ASSISTANCE HOPE TO GOD YOU DON\u0027T HAVE TO DEAL WITH STERLING!",
      "createTime": "2018-02-14T16:46:00.888Z",
      "updateTime": "2018-02-14T16:46:00.888Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSUNReE56SGNREAE"
    },
    {
      "reviewer": {
        "displayName": "Patti Reimer"
      },
      "starRating": "FIVE",
      "createTime": "2017-02-18T00:36:43.226Z",
      "updateTime": "2017-02-18T00:36:43.226Z",
      "name": "accounts/114147206379557324111/locations/5479012694615267473/reviews/ChZDSUhNMG9nS0VJQ0FnSURBbi1qLWFnEAE"
    }
  ]
}